import React from 'react';
import { Row, Col, Image } from 'antd'
import cosmonaut from '../homePic.PNG'
import '../Styles/Home.css'

function Home(props) {
    return (
        <div className='home-body'>
            <Row>
                <Col span={14} className="welcome-text">
                    <div className="title">Оглядайте найпопулярніші криптовалюти</div>
                    <div className="main-text">CryptoView - це універсальна програма, яка надає широкий спектр сервісів з відображення курсу та прогнозу криптовалют, а також дозволяє їх аналізувати. Після використання цей сервіс стане незамінним інструментом для отримання надійної та актуальної інформації про ринок криптовалют.

Основні функції CryptoView: 

Відображення курсу криптовалют: CryptoView пропонує велику кількість криптовалют для відстеження, включаючи найпопулярніші, такі як Bitcoin, Ethereum, Ripple та багато інших. Програма надає в режимі реального часу актуальні дані про ціни, обсяги торгів та графіки змін курсу кожної криптовалюти.

Прогнозування криптовалютного курсу: З використанням складних алгоритмів і штучного інтелекту CryptoView забезпечує користувачам можливість отримати прогнози щодо майбутнього курсу криптовалют. Прогнози базуються на аналізі історичних даних.

Аналіз криптовалютних даних: CryptoView надає розширені інструменти для аналізу ринку криптовалют. Користувачі можуть переглядати графіки змін курсу, проводити технічний аналіз, використовувати різноманітні індикатори та інші інструменти для дослідження ринкових тенденцій та здійснення прийняття обґрунтованих інвестиційних рішень.
                    </div>
                </Col>
                <Col span={10}>
                    <Image className="cosmonaut-image" preview={false} src={cosmonaut}/>
                </Col>
            </Row>
        </div>
    );
}

export default Home;